software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/CQL1-allSites.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:dat="http://gov.nih.nci.cagrid.data/DataService"
xmlns:gov="http://CQL.caBIG/1/gov.nih.nci.cagrid.CQLQuery">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:QueryRequest>
         <dat:cqlQuery>
            <gov:CQLQuery>
                <gov:Target name="edu.wustl.catissuecore.domain.Site"/>
            </gov:CQLQuery>
         </dat:cqlQuery>
      </dat:QueryRequest>
   </soapenv:Body>
</soapenv:Envelope>